[
  {
    "title": "Pokedex",
    "imageSrc": "projects/Pokedex-App.png",
    "description": "This is the first responsive web app that I created. It retrieves information from an external API and displays it for the user. I used HTML, CSS, and JavaScript in the creation of this app.",
    "skills": [
      "HTML ",
      "CSS ",
      "JavaScript"
    ],
    "demo": "https://mcillo.github.io/simple-js-app/",
    "source": "https://github.com/MCillo/simple-js-app",
    "caseStudy": "src/components/CaseStudies/PokedexCaseStudy.html",
    "overview": "The Pokedex Web Application is a web app that was developed using HTML,CSS,and JavaScript.This app will provide users with information about Pokemon. Users will be able to view a list of all Pokemon as well as search for a particular Pokemon using the search function. The user can also select a Pokemon and view more detailed information about the Pokemon.",
    "purposeContext": "Pokedex was the first of many projects that I built as a part of my Carer Foundry Full Stack Web Development course. The purpose of this particular project was to learn some of the basics of HTML, CSS, and JavaScript while developing a fully functioning web app.",
    "objective": "My objective with this project was to build a simple web apt that I could use in my portfolio to demonstrate my initial understanding of web app development. The problem I set out to solve was how to build a web application that could acess data from an external API and display that data to a user.",
    "approach": [
      "To begin this project I needed to learn the fundamentals of JavaScript. I began by learning how to work with objects, arrays, conditionals and loops. With this new knowledge I began working with functions and learning the principals of Functional Programming and its comparison with Object Oriented Programming. I finished with learning how to work with external APIs to retreive information and how to display that information to the user. ",
      "While I was working with the JavaScript portion of this project I was also working with the HTML aspect. Getting information from the API is one thing, displaying it to the user in a useful manner was just as important. I learned how to work with the Document Object Model within JavaScript in order to render the information from the API into the HTML of the webpage for the user to view and interact with. ",
      "Once I had the web app functioning properly I needed to make it look pleasing to the user. For this I learned how to use the Bootstrap frame work to create a clean User Interface. With this knowledge I also added the Modal that would be used to display the information for the selected Pokemon to the user. To further add to the users experience I utilized CSS to add styling to the app as well as making the app responsive to different sized screens."
    ],
    "challenges": "This was the first web application that I created and with that came several challenges. The biggest challenge I faced was balancing a full time job and a family while also trying to learn the basics of the languages I used to create this app.",
    "duration": "The development of this app took me a little over two months from start to finish. The length of this project stemmed from finding the balance between work and learning and understanding the new languages I was using for the app.",
    "credits": "Although I used many online sources to understand the material and to help me create this APP these were some of the ones I used more often. Career Foundry - https:/careerfoundry.com MDN Web Docs - https:/developer.mozilla.org/en-US/ W3 Schools - https:/www.w3schools.com/cs/ JavaScript - https:/www.javascript.com"
  },
  {
    "title": "MyFlix API",
    "imageSrc": "projects/project.png",
    "description": "This project was my initial foray into creating my very own REST API. In this project I used REACT to build a server side component to a Movies Web APP. This project also uses MongoDB as the Database that holds all the movie information.",
    "skills": [
      "REST API",
      "MongoDB",
      "Postman",
      "JavaScript"
    ],
    "demo": "https://myflix765.netlify.app/login",
    "source": "https://github.com/MCillo/movie_api.git",
    "caseStudy": "MyFlix API Case Study",
    "overview": "The MyFlix API was ",
    "purposeContext": "",
    "objective": "",
    "approach": "",
    "challenges": "",
    "duration": "",
    "credits": ""
  },
  {
    "title": "MyFlix Client",
    "imageSrc": "projects/My-Flix-Client.png",
    "description": "This project uses REACT to create the client side for a Single Page Application that works with Movie API to display movie information to the user.",
    "skills": [
      "React",
      "JSX",
      "React Bootstrap",
      "Parcel"
    ],
    "demo": "https://myflix765.netlify.app/login",
    "source": "https://github.com/MCillo/myFlix-client.git",
    "caseStudy": "MyFlix Client Case Study",
    "overview": "",
    "purposeContext": "",
    "objective": "",
    "approach": "",
    "challenges": "",
    "duration": "",
    "credits": ""
  },
  {
    "title": "Meet App",
    "imageSrc": "projects/Meet-App.png",
    "description": "This project taught me to use a Test Driven Development approach using REACT to build a serverless, Progressive Web Application. This application uses the Google Calendar API to fetch upcoming events.",
    "skills": [
      "React",
      "TDD Technique",
      "Google Calendar API",
      "Serverless Functions"
    ],
    "demo": "https://mcillo.github.io/meet/",
    "source": "https://github.com/MCillo/meet.git",
    "caseStudy": "Meet App Case Study",
    "overview": "",
    "purposeContext": "",
    "objective": "",
    "approach": "",
    "challenges": "",
    "duration": "",
    "credits": ""
  },
  {
    "title": "Chat App",
    "imageSrc": "projects/Chat-App-Homescreen.png",
    "description": "This is a Chat App that was built using React Native, Expo, and Google Firestore Database. This app helped me learn and demonstrate my knowledge of Javascript mobile development.",
    "skills": [
      "React Native",
      "Expo",
      "Google Firestore DB"
    ],
    "demo": "https://mcillo.github.io/meet/",
    "source": "https://github.com/MCillo/Chat-App.git",
    "caseStudy": "Chat App Case Study",
    "overview": "",
    "purposeContext": "",
    "objective": "",
    "approach": "",
    "challenges": "",
    "duration": "",
    "credits": ""
  },
  {
    "title": "MyFlix Angular Client",
    "imageSrc": "projects/MyFlix-Angular-Client.png",
    "description": "This project was built using Angular and was a recreation of the My Flix Client that used JavaScript.",
    "skills": [
      "Angular",
      "TypeScript",
      "Node.js"
    ],
    "demo": "https://mcillo.github.io/MyFlix-Angular-Client/",
    "source": "https://github.com/MCillo/MyFlix-Angular-Client.git",
    "caseStudy": "MyFlix Angular Case Study",
    "overview": "",
    "purposeContext": "",
    "objective": "",
    "approach": "",
    "challenges": "",
    "duration": "",
    "credits": ""
  }
]